// как использовать тему оформления? ни описания по ней нет ни как применять

// как добавить карту mapbox к реакт без реф?, сказали что реф это малоприменимая практика и если можно обойтись без них, то нужно без них
// и вообще как добавить карту к реакту? импортить компоненты я умею 

// как реализовать механизм проптайпс в тайпскрипт для отслеживания именованных пропсов?

// не понятно как переписать теперь наш компонент под контекст апи

// если не успеем написать тесты для всех компонентов, просьба показать тесты для какогонибудь одного компонента, например авторизации или подгрузки карты в реакт